Управление ИТ фирмой/Documents/РеализацияТоваровИУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РеализацияТоваровИУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Доходы</xr:Item>
				<xr:Item>AccumulationRegister.Товары</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.Расходы</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТоварыИУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Управление ИТ фирмой/AccumulationRegisters/Товары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Товары</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Управление ИТ фирмой/AccountingRegisters/Управленческий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>Управленческий</Name>
			<ChartOfAccounts>ChartOfAccounts.Управленческий</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Управление ИТ фирмой/AccumulationRegisters/Доходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Доходы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Управление ИТ фирмой/AccumulationRegisters/Расходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Расходы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Управление ИТ фирмой/AccumulationRegisters/ВзаиморасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Управление ИТ фирмой/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Управление ИТ фирмой/Documents/РеализацияТоваровИУслуг/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Сумма = ТоварыИУслуги.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.Товары.Очистить();
	Движения.Управленческий.Очистить();
	
	Движения.Товары.Записать();
	Движения.Управленческий.Записать();
	
	Движения.Товары.Записывать = Истина;
	Движения.Доходы.Записывать = Истина;
	Движения.Расходы.Записывать = Истина;
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	Движения.Управленческий.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоварыИУслуги.Номенклатура КАК Номенклатура,
		|	РеализацияТоварыИУслуги.Номенклатура.Тип КАК ТипНоменклатуры,
		|	СУММА(РеализацияТоварыИУслуги.Количество) КАК КоличествоПродажи,
		|	СУММА(РеализацияТоварыИУслуги.Сумма) КАК СуммаВыручки
		|ПОМЕСТИТЬ ВТ_ТоварыДокумента
		|ИЗ
		|	Документ.РеализацияТоваровИУслуг.ТоварыИУслуги КАК РеализацияТоварыИУслуги
		|ГДЕ
		|	РеализацияТоварыИУслуги.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоварыИУслуги.Номенклатура,
		|	РеализацияТоварыИУслуги.Номенклатура.Тип
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТоварыДокумента.Номенклатура КАК Номенклатура,
		|	ВТ_ТоварыДокумента.ТипНоменклатуры КАК ТипНоменклатуры,
		|	ВТ_ТоварыДокумента.КоличествоПродажи КАК КоличествоПродажи,
		|	ВТ_ТоварыДокумента.СуммаВыручки КАК СуммаВыручки,
		|	ЕСТЬNULL(ТоварыОстатки.КоличествоОстаток, 0) КАК НакоплениеКоличествоОстаток,
		|	ЕСТЬNULL(ТоварыОстатки.СуммаОстаток, 0) КАК НакоплениеСуммаОстаток,
		|	ЕСТЬNULL(БухОстатки.КоличествоОстаток, 0) КАК БухКоличествоОстаток,
		|	ЕСТЬNULL(БухОстатки.СуммаОстаток, 0) КАК БухСуммаОстаток
		|ИЗ
		|	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Товары.Остатки(&МоментВремени, Номенклатура В (ВЫБРАТЬ ВТ.Номенклатура ИЗ ВТ_ТоварыДокумента КАК ВТ)) КАК ТоварыОстатки
		|		ПО ВТ_ТоварыДокумента.Номенклатура = ТоварыОстатки.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Управленческий.Остатки(
		|				&МоментВремени,
		|				Счет = &СчетТовары,
		|				,
		|				Субконто1 В (ВЫБРАТЬ ВТ.Номенклатура ИЗ ВТ_ТоварыДокумента КАК ВТ)) КАК БухОстатки
		|		ПО ВТ_ТоварыДокумента.Номенклатура = БухОстатки.Субконто1";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("СчетТовары", ПланыСчетов.Управленческий.Товары);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар Тогда
			
			Если Выборка.КоличествоПродажи > Выборка.НакоплениеКоличествоОстаток Тогда
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Ошибка списания УУ! Не хватает товара %1 в регистре накопления в количестве %2 шт. (Доступно: %3)", 
					Выборка.Номенклатура, Выборка.КоличествоПродажи - Выборка.НакоплениеКоличествоОстаток, Выборка.НакоплениеКоличествоОстаток);
				Сообщение.Сообщить();
			КонецЕсли;
			
			Если Выборка.КоличествоПродажи > Выборка.БухКоличествоОстаток Тогда
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Ошибка списания БУ! Не хватает товара %1 на счете 41 Управленческий в количестве %2 шт. (Доступно: %3)", 
					Выборка.Номенклатура, Выборка.КоличествоПродажи - Выборка.БухКоличествоОстаток, Выборка.БухКоличествоОстаток);
				Сообщение.Сообщить();
			КонецЕсли;
			
			Если Отказ Тогда
				Продолжить;
			КонецЕсли;
			
			Если Выборка.КоличествоПродажи = Выборка.НакоплениеКоличествоОстаток Тогда
				СебестоимостьНакопление = Выборка.НакоплениеСуммаОстаток;
			Иначе
				СебестоимостьНакопление = (Выборка.НакоплениеСуммаОстаток / Выборка.НакоплениеКоличествоОстаток) * Выборка.КоличествоПродажи;
				СебестоимостьНакопление = Окр(СебестоимостьНакопление, 2);
			КонецЕсли;
			
			Если Выборка.КоличествоПродажи = Выборка.БухКоличествоОстаток Тогда
				СебестоимостьБух = Выборка.БухСуммаОстаток;
			Иначе
				СебестоимостьБух = (Выборка.БухСуммаОстаток / Выборка.БухКоличествоОстаток) * Выборка.КоличествоПродажи;
				СебестоимостьБух = Окр(СебестоимостьБух, 2);
			КонецЕсли;
			
			Движение = Движения.Товары.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Количество = Выборка.КоличествоПродажи;
			Движение.Сумма = СебестоимостьНакопление; 
			
			Движение = Движения.Расходы.Добавить();
			Движение.Период = Дата;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Сумма = СебестоимостьНакопление;
			
			ПроводкаСписание = Движения.Управленческий.Добавить();
			ПроводкаСписание.Период = Дата;
			ПроводкаСписание.СчетДт = ПланыСчетов.Управленческий.Расходы;
			ПроводкаСписание.СчетКт = ПланыСчетов.Управленческий.Товары;
			ПроводкаСписание.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Выборка.Номенклатура;
			ПроводкаСписание.КоличествоКт = Выборка.КоличествоПродажи;
			ПроводкаСписание.Сумма = СебестоимостьБух;
			
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			ДвижениеДоходы = Движения.Доходы.Добавить();
			ДвижениеДоходы.Период = Дата;
			ДвижениеДоходы.Номенклатура = Выборка.Номенклатура;
			ДвижениеДоходы.Количество = Выборка.КоличествоПродажи;
			ДвижениеДоходы.Сумма = Выборка.СуммаВыручки;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЭтотОбъект.Сумма > 0 И НЕ Отказ Тогда
		
		Движение = Движения.ВзаиморасчетыСКонтрагентами.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Контрагент = Покупатель;
		Движение.Сумма = ЭтотОбъект.Сумма;
		
		ПроводкаВыручка = Движения.Управленческий.Добавить();
		ПроводкаВыручка.Период = Дата;
		ПроводкаВыручка.СчетДт = ПланыСчетов.Управленческий.РасчетыСПокупателями;
		ПроводкаВыручка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Покупатель;
		ПроводкаВыручка.СчетКт = ПланыСчетов.Управленческий.Выручка;
		ПроводкаВыручка.Сумма = ЭтотОбъект.Сумма;
		
	КонецЕсли;
	
КонецПроцедуры
